Repository: sugarlabs/turtleart-activity
Catalog: po/*.po
Languages: de

source: Turtle Art Mini
de: Schildkrötenkunst Mini

source: Turtle Confusion
de: Schildkrötenwirrwarr

source: Select a challenge
de: Wähle eine Herausforderung

source: Amazonas Tortuga
de: Amazonas-Schildkröte

source: Palette of Mexican pesos
de: Palette der mexikanischen Pesos

source: Palette of Colombian pesos
de: Palette der kolumbianischen Pesos

source: Palette of Rwandan francs
de: Palette der ruandischen Francs

source: Palette of US dollars
de: Palette der US-Dollars

source: Palette of Australian dollars
de: Palette der australischen Dollars

source: Palette of Paraguayan Guaranies
de: Palette der paraguayischen Guaranies

source: Palette of Peruvian Nuevo Soles
de: Palette der peruanischen Nuevo Soles

source: Palette of Uruguayan Pesos
de: Palette der uruguayischen Pesos

source: TurtleBots
de: SchildkrötenBots

source: ERROR: The speed must be a value between 0 and 1023
de: FEHLER: Die Geschwindigkeit muss einen Wert zwischen 0 und 1023 haben.

source: ERROR: The mode must be INPUT or OUTPUT.
de: FEHLER: Als Modus muss entweder EINGANG oderAUSGANG gewählt werden.

source: adjust LED intensity between 0 and 255
de: LED-Intensität festlegen (von 0 bis 255)

source: returns the gray level
de: gibt die Graustufe zurück

source: returns 1 when the button is press and 0 otherwise
de: Gibt 1 zurück, wenn der Knopf gedrückt ist, sonst 0.

source: returns the ambient light level
de: Gibt die Umgebungslichtstärke zurück.

source: returns the ambient temperature
de: Gibt die Umgebungstemperatur zurück.

source: returns the distance from the object in front of the sensor
de: Gibt den Abstand des Objektes vom Sensor zurück.

source: returns 0 or 1 depending on the sensor inclination
de: Gibt je nach Sensorneigung 0 oder 1 zurück.

source: returns 1 when the sensors detects a magnetic field, 0 otherwise
de: Gibt 1 zurück, wenn der Sensor ein magnetisches Feld detektiert, sonst 0.

source: switches from 0 to 1, the frequency depends on the vibration
de: Wechselt von 0 zu 1; die Frequenz hängt von der Vibration ab.

source: returns the value of the resistance
de: Gibt den Wert des Widerstandes zurück.

source: returns the value of the voltage
de: Gibt den Wert der Spannung zurück.

source: button
de: Knopf

source: grayscale
de: Grauwert

source: ambient light
de: Umgebungslicht

source: temperature
de: Temperatur

source: distance
de: Abstand

source: resistance
de: Widerstand

source: voltage
de: Spannung

source: Butia Robot
de: Butia-Roboter

source: battery charge Butia
de: Ladezustand der Batterie des Butia

source: returns the battery charge as a number between 0 and 255
de: Gibt den Ladezustand der Batterie als Zahl zwischen 0 und 255 zurück.

source: speed Butia
de: Butia-Geschwindigkeit

source: set the speed of the Butia motors
de: Stellt die Geschwindigkeit des Butia-Motors ein.

source: move Butia
de: bewegt Butia

source: left
de: links

source: right
de: rechts

source: moves the Butia motors at the specified speed
de: Bewegt die Butia-Motoren in der festgelegten Geschwindigkeit.

source: stop Butia
de: Butia anhalten

source: stop the Butia robot
de: Halte den Butia-Roboter an.

source: forward Butia
de: Butia vor

source: move the Butia robot forward
de: Bewege den Butia-Roboter vorwärts.

source: left Butia
de: Butia nach links

source: right Butia
de: Butia nach rechts

source: turn the Butia robot at right
de: Drehe den Butia-Roboter nach rechts.

source: backward Butia
de: Butia zurück

source: move the Butia robot backward
de: Bewege den Butia-Roboter rückwärts.

source: pin
de: Fixierung

source: mode
de: Modus

source: value
de: Wert

source: HIGH
de: HOCH

source: Set HIGH value for digital port.
de: Setze HOCH-Wert für den digitalen Port.

source: INPUT
de: EINGANG

source: LOW
de: NIEDRIG

source: Set LOW value for digital port.
de: Setze NIEDRIG-Wert für den digitalen Port.

source: OUTPUT
de: AUSGANG

source: Error importing Pygame. This plugin require Pygame 1.9
de: Fehler beim Importieren von Pygame. Dieses Plugin benötigt Pygame 1.9.

source: Error on initialization of the camera
de: Fehler beim Einrichten der Kamera.

source: No camera was found
de: Es wurde keine Kamera gefunden.

source: Error stopping camera
de: Fehler beim Anhalten der Kamera

source: Error starting camera
de: Fehler beim Einschalten der Kamera

source: FollowMe
de: FolgeMir

source: calibration
de: Kalibrierung

source: return a personalized calibration
de: gib eine individuelle Kalibrierung zurück

source: follow
de: folge

source: follow a color or calibration
de: folge einer Farbe oder Kalibrierung

source: brightness
de: Helligkeit

source: set the camera brightness as a value between 0 to 255.
de: Gib bitte der Helligkeit der Kamera einen Wert zwischen 0 und 255.

source: minimum pixels
de: minimale Pixelanzahl

source: set the minimal number of pixels to follow
de: Setze die Minimalzahl zu verfolgender Pixel fest

source: threshold
de: Grenzwert

source: set a threshold for a RGB color
de: setze einen Grenzwert für eine RGB-Farbe

source: camera mode
de: Kameramodus

source: average color
de: Durchschnittswert der Farbe

source: return x position
de: gib die x-Position zurück

source: return y position
de: gib die y-Position zurück

source: pixels
de: Pixel

source: return the number of pixels of the biggest blob
de: Gib die Zahl der Pixel im größten Fleck zurück

source: set the color mode of the camera to RGB
de: Setze den Farbmodus der Kamera auf RGB

source: set the color mode of the camera to YUV
de: Setze den Farbmodus der Kamera auf YUV

source: set the color mode of the camera to HSV
de: Setze den Farbmodus der Kamera auf HSV

source: empty calibration
de: leere Kalibrierung

source: speed SumBot
de: Geschwindigkeit des SumBot

source: submit the speed to the SumBot
de: Übermittle die Geschwindigkeit auf den Sumbot

source: set the default speed for the movement commands
de: Setze die Standardgeschwindigkeit für die Bewegungsbefehle

source: forward SumBot
de: SumBot vor

source: move SumBot forward
de: Bewege den SumBot vorwärts

source: backward SumBot
de: SumBot zurück

source: move SumBot backward
de: Bewege den SumBot rückwärts

source: stop SumBot
de: SumBot anhalten

source: stop the SumBot
de: Halte den SumBot an

source: left SumBot
de: SumBot nach links

source: turn left the SumBot
de: Drehe den SumBot nach links

source: right SumBot
de: SumBot nach rechts

source: turn right the SumBot
de: Drehe den SumBot nach rechts

source: angle to center
de: Winkel zum Zentrum

source: get the angle to the center of the dohyo
de: Bestimme den Winkel zum Zentrum des Dohyo.

source: angle to Enemy
de: Winkel zum Gegner

source: get the angle to the Enemy
de: Bestimme den Winkel zum Gegner.

source: x coor. SumBot
de: x-Koordinate Roboter

source: get the x coordinate of the SumBot
de: Bestimme die x-Koordinate des Roboters.

source: y coor. SumBot
de: y-Koordinate Roboter

source: get the y coordinate of the SumBot
de: Bestimme die y-Koordinate des Roboters.

source: x coor. Enemy
de: x-Koordinate Gegner

source: get the x coordinate of the Enemy
de: Bestimme die x-Koordinate des Gegners.

source: y coor. Enemy
de: y-Koordinate Gegner

source: get the y coordinate of the Enemy
de: Bestimme die y-Koordinate des Gegners.

source: rotation SumBot
de: Drehung Roboter

source: get the rotation of the Sumbot
de: Bestimme die Drehung des Roboters.

source: rotation Enemy
de: Drehung Gegner

source: get the rotation of the Enemy
de: Bestimme die Drehung des Gegners.

source: distance to center
de: Entfernung zur Mitte

source: get the distance to the center of the dohyo
de: Bestimme die Entfernung zur Mitte des Dohyo.

source: distance to Enemy
de: Entfernung zum Gegner

source: get the distance to the Enemy
de: Bestimme die Entfernung zum Gegner.

source: update information
de: aktualisiere Informationen

source: update information from the server
de: Aktualisiere die Informationen vom Server.

source: Palette of physics blocks
de: Palette der Physikblöcke

source: start polygon
de: Vieleck anfangen

source: Begin defining a new polygon based on the current Turtle xy position.
de: Fange an der aktuellen Position der Schildkröte an, ein Vieleck zu erstellen.

source: add point
de: Punkt hinzufügen

source: Add a new point to the current polygon based on the current Turtle xy position.
de: Füge dem aktuellen Vieleck eine neue Ecke an der aktuellen Position der Schildkröte hinzu.

source: end polygon
de: Vieleck beenden

source: Define a new polygon.
de: Definiere ein neues Vieleck.

source: end filled polygon
de: Ausgefülltes Vieleck beenden

source: Not a simple polygon
de: Kein einfaches Vieleck

source: Define a new filled polygon.
de: Definiere ein neues gefülltes Vieleck.

source: triangle
de: Dreieck

source: base
de: Basis

source: height
de: Höhe

source: Add a triangle object to the project.
de: Füge ein Dreiecksobjekt zum Projekt hinzu.

source: circle
de: Kreis

source: Add a circle object to the project.
de: Füge ein Kreisobjekt zum Projekt hinzu.

source: rectangle
de: Rechteck

source: width
de: Breite

source: Add a rectangle object to the project.
de: Füge ein Rechtecksobjekt zum Projekt hinzu.

source: reset
de: Zurücksetzen

source: Reset the project; clear the object list.
de: Setze das Projekt zurück; leere die Objektliste.

source: torque
de: Drehmoment

source: speed
de: Geschwindigkeit

source: Motor torque and speed range from 0 (off) to positive numbers; motor is placed on the most recent object created.
de: Drehmoment des Motors und Geschwindigkeit variieren von 0 (aus) zu positiven Zahlen; der Motor wird auf dem zuletzt erzeugten Objekt platziert.

source: Pin an object down so that it cannot fall.
de: Hefte ein Objekt fest an, sodass es nicht fallen kann.

source: joint
de: Verbindung

source: Join two objects together (the most recent object created and the object at point x, y).
de: Verbinde zwei Objekte miteinander (das zuletzt erzeugte Objekt und das Objekt am Punkt x, y).

source: save as Physics activity
de: Speichern als Physik-Aktivität

source: Save the project to the Journal as a Physics activity.
de: Speichere das Projekt als Physik-Aktivität ins Tagebuch.

source: gear
de: Zahnrad

source: Add a gear object to the project.
de: Füge ein Zahnradobjekt zum Projekt hinzu.

source: density
de: Dichte

source: Set the density property for objects (density can be any positive number).
de: Setze die Dichte als Eigenschaft für Objekte (Dichte kann jede positive Zahl sein).

source: friction
de: Reibung

source: Set the friction property for objects (value from 0 to 1, where 0 turns friction off and 1 is strong friction).
de: Setze die Reibung als Eigenschaft für Objekte (ein Wert zwischen 0 und 1, wobei 0 Reibungslosigkeit bedeutet und 1 starke Reibung).

source: bounciness
de: Elastizität

source: Set the bounciness property for objects (a value from 0 to 1, where 0 means no bounce and 1 is very bouncy).
de: Setze die Elastizität als Eigenschaft für Objekte (ein Wert zwischen 0 und 1, wobei 0 keine und 1 volle Elastizität bedeutet).

source: dynamic
de: Beweglichkeit

source: If dynamic = 1, the object can move; if dynamic = 0, it is fixed in position.
de: Bei Beweglichkeit = 1 kann sich das Objekt bewegen; bei Beweglichkeit = 0 besitzt es eine feste Position.

source: Palette of WeDo blocks
de: Palette der WeDo-Blöcke

source: number of WeDo devices
de: Anzahl der WeDo-Geräte

source: tilt
de: Neigung

source: tilt sensor output: (-1 == no tilt, 0 == tilt forward, 3 == tilt back, 1 == tilt left, 2 == tilt right)
de: Ausgabe des Neigungssensors: (-1 == keine Neigung, 0 == vorwärts, 3 == rückwärts, 1 == nach links geneigt, 2 == nach rechts geneigt)

source: distance sensor output
de: Ausgabe des Entfernungssensors

source: returns the current value of Motor A
de: Liefert den aktuellen Wert von Motor A.

source: returns the current value of Motor B
de: Liefert den aktuellen Wert von Motor B.

source: set the value for Motor A
de: Setze den Wert für Motor A.

source: set the value for Motor B
de: Setze den Wert für Motor B.

source: WeDo is unavailable
de: WeDo ist nicht verfügbar.

source: WeDo %d is unavailable; defaulting to 1
de: WeDo %d ist nicht verfügbar; es wird auf 1 zurückgesetzt.

source: Palette of LEGO NXT blocks of motors
de: Palette der LEGO-NXT-Blöcke für Motoren

source: Palette of LEGO NXT blocks of sensors
de: Palette der LEGO-NXT-Blöcke für Sensoren

source: touch
de: Berührung

source: ultrasonic
de: Ultraschall

source: color
de: Farbe

source: light
de: Helligkeit

source: sound
de: Klang

source: gray
de: Grau

source: Please check the connection with the brick
de: Bitte überprüfe die Verbindung mit dem Stein.

source: Invalid port '%s'. Port must be: PORT A, B or C
de: Der Port '%s' ist ungültig. Der Port muss entweder PORT A, B oder C sein.

source: Invalid port '%s'. Port must be: PORT 1, 2, 3 or 4
de: Der Port '%s' ist ungültig. Der Port muss entweder PORT 1, 2, 3 oder 4 sein.

source: The value of power must be between -127 to 127
de: Der Kraftwert muss zwischen -127 und 127 liegen.

source: The parameter must be a integer, not '%s'
de: Der Wert muss eine ganze Zahl sein, nicht '%s'.

source: An error has occurred: check all connections and try to reconnect
de: Ein Fehler ist aufgetreten. Überprüfe alle Verbindungen und versuche dich neu zu verbinden.

source: NXT found %s bricks
de: NXT hat %s Steine gefunden.

source: NXT not found
de: NXT nicht gefunden

source: Brick number %s was not found
de: Stein Nummer %s wurde nicht gefunden.

source: refresh NXT
de: NXT erneuern

source: Search for a connected NXT brick.
de: Suche nach einem verbundenen NXT-Stein.

source: play tone
de: Ton abspielen

source: frequency
de: Frequenz

source: time
de: Zeit

source: Play a tone at frequency for time.
de: Spiele einen Ton einer Frequenz für die Dauer ab.

source: power
de: Spannung

source: rotations
de: Drehungen

source: turn a motor
de: Einen Motor drehen

source: synchronize two motors connected in PORT B and PORT C
de: Synchronisiert zwei Motoren, die an PORT B und PORT C angeschlossen sind.

source: PORT A of the brick
de: PORT A des Steins

source: PORT B of the brick
de: PORT B des Steins

source: PORT C of the brick
de: PORT C des Steins

source: start motor
de: Motor starten

source: Run a motor forever.
de: Lass einen Moter dauernd laufen.

source: brake motor
de: Motor anhalten

source: Stop a specified motor.
de: Stopp einen bestimmten Motor.

source: reset motor
de: Motor zurücksetzen

source: Reset the motor counter.
de: Setze den Motorzähler zurück.

source: Get the motor position.
de: Erhalte die Motorposition.

source: PORT 1 of the brick
de: PORT 1 des Steins

source: read
de: Auslesen

source: Read sensor output.
de: Lies die Sensorausgabe aus.

source: PORT 2 of the brick
de: PORT 2 des Steins

source: light sensor
de: Helligkeitssensor

source: PORT 3 of the brick
de: PORT 3 des Steins

source: touch sensor
de: Berührungssensor

source: distance sensor
de: Entfernungssensor

source: PORT 4 of the brick
de: PORT 4 des Steins

source: sound sensor
de: Geräuschsensor

source: color sensor
de: Farbsensor

source: set light
de: Helligkeit einstellen

source: Set color sensor light.
de: Stelle die Helligkeit des Farbsensors ein.

source: battery level
de: Batterieladung

source: ERROR: Check the Arduino and the number of port.
de: FEHLER: Überprüfe den Arduino und die Portnummer.

source: ERROR: Value must be a number from 0 to 255.
de: FEHLER: Der Wert muss eine Zahl von 0 bis 255 sein.

source: ERROR: Value must be either HIGH or LOW.
de: FEHLER: Der Wert muss entweder HOCH oder NIEDRIG sein.

source: ERROR: The mode must be either INPUT, OUTPUT, PWM or SERVO.
de: FEHLER: Der Modus muss entweder EINGANG oder AUSGANG oder PWM oder SERVO sein.

source: pin mode
de: Pin-Modus

source: Select the pin function (INPUT, OUTPUT, PWM, SERVO).
de: Wähle die Pin-Funktion (EINGANG, AUSGANG, PWM, SERVO).

source: analog write
de: Analog Schreiben

source: Write analog value in specified port.
de: Schreibe analogen Wert in den angegebenen Port.

source: analog read
de: Analog Lesen

source: Read value from analog port. Value may be between 0 and 1023. Use Vref to determine voltage. For USB, volt=((read)*5)/1024) approximately.
de: Lies den Wert aus dem analogen Port. Der Wert darf zwischen 0 und 1023 liegen. Benutze Vref, um die Spannun zu bestimmen. Für USB gilt ungefähr volt=((read)*5)/1024.

source: digital write
de: Digital Schreiben

source: Write digital value to specified port.
de: Schreibe digitalen Wert in den angegebenen Port.

source: digital read
de: Digital Lesen

source: Read value from digital port.
de: Lies den Wert aus dem digitalen Port.

source: Configure Arduino port for digital input.
de: Konfiguriere den Arduino-Port für den digitalen Eingang.

source: Configure Arduino port to drive a servo.
de: Konfiguriere den Arduino-Port, um ein Servo anzusteuern.

source: Configure Arduino port for digital output.
de: Konfiguriere den Arduino-Port für den digitalen Ausgang.

source: Configure Arduino port for PWM (pulse-width modulation).
de: Konfiguriere den Arduino-Port für PWM (Pulsweitenmodulierung).

source: returns 1 if IN1 voltage level >2.5 volts, 0 if IN1 voltage level <= 2.5 volts
de: Gibt 1 zurück, wenn die Spannung an IN1 > 2.5 V, und 0, wenn die Spannung <= 2,5 V beträgt.

source: returns 1 if IN2 voltage level >2.5 volts, 0 if IN2 voltage level <= 2.5 volts
de: Gibt 1 zurück, wenn die Spannung an IN2 > 2.5 V, und 0, wenn die Spannung <= 2,5 V beträgt.

source: resume playing video or audio
de: Audio oder Video weiter abspielen

source: Title
de: Titel

source: Average RGB color from camera is pushed to the stack
de: Die gemittelte RGB-Farbe aus der Kamera wird auf den Stapel abgelegt

source: yellow
de: Gelb

source: displays polar coordinates
de: Polarkoordinaten anzeigen

source: emptys FILO (first-in-last-out heap)
de: leert FILO-Stapel (first in, last out)

source: camera output
de: Kameraausgabe

source: push acceleration in x, y, z to heap
de: x,y,z-Beschleunigung auf zum Stapel hinzufügen

source: if-then operator that uses boolean operators from Numbers palette
de: Wenn-Dann-Operator, der boolesche Operatoren aus der mathematischen Palette nutzt

source: jogs stack right
de: Stapel nach rechts versetzen

source: Sugar Journal media object
de: Medienobjekt aus dem Sugar-Tagebuch

source: Step
de: Einzelschritte

source: multiplies two numeric inputs
de: Zwei Zahleneingaben multiplizieren

source: Show/hide blocks
de: Blöcke zeigen/verbergen

source: Hide palette
de: Palette verbergen

source: Buddies
de: Partner

source: My Turtle Art session
de: Meine Schildkrötenkunst-Sitzung

source: Sugar Journal video object
de: Videoobjekt aus dem Sugar-Tagebuch

source: cyan
de: Zyan

source: A Logo-inspired turtle that draws colorful pictures with snap-together visual programming blocks
de: Eine von Logo inspirierte Schildkröte, die mittels visueller Programmierbausteine farbenfrohe Bilder zeichnet

source: xcor of right of screen
de: x-Koordinate des rechten Bildschirmrandes

source: Palette of extra options
de: Palette der erweiterten Optionen

source: Load example
de: Beispiel laden

source: move all blocks to trash
de: Alle Blöcke in den Mülleimer verschieben

source: list
de: Liste

source: Configuration directory not writable: %s
de: Kann nicht in Einstellungsverzeichnis schreiben: %s

source: media resume
de: Medien fortsetzen

source: heading
de: Richtung

source: Sharing blocks disabled
de: Teilen von Blöcken ist ausgeschaltet.

source: saves turtle graphics as an SVG file in the Sugar Journal
de: Eine Schildkröten-Grafik als SVG ins Sugar-Tagebuch speichern

source: draws text or show media from the Journal
de: Text zeichnen oder Medien aus dem Tagebuch anzeigen

source: blue
de: Blau

source: displays Cartesian coordinates
de: Kartesische Koordinaten anzeigen

source: No option action:
de: Keine optionale Aktion:

source: jogs stack down
de: Stapel nach unten versetzen

source: modular (remainder) operator
de: Modulo-Operator (Divisionsrest)

source: bottom y
de: unten: y

source: save SVG
de: Als SVG speichern

source: runs code found in the tamyblock.py module found in the Journal
de: Code aus dem Modul tamyblock.py aus dem Tagebuch ausführen

source: pen down
de: senke Stift ab

source: wait
de: warte

source: Failed to upload!
de: Hochladen fehlgeschlagen!

source: invokes named action stack
de: Stapel einer benannten Aktion aufrufen

source: action
de: Aktion

source: do-until-True operator that uses boolean operators from Numbers palette
de: Wiederhole-bis-Operator, der boolesche Operatoren aus der mathematischen Palette nutzt

source: usage is
de: Auslastung beträgt

source: Variable 2 (numeric value)
de: Variable 2 (Zahlenwert)

source: divide
de: geteilt durch

source: picture name
de: Bildname

source: while
de: solange

source: the canvas width
de: Die Fensterbreite

source: empty heap?
de: Stapel leer?

source: named variable (numeric value)
de: Benannte Variable (Zahlenwert)

source: next
de: Nächstes

source: if then
de: wenn dann

source: set pen size
de: setze Stiftdicke

source: presentation template: select Journal object (no description)
de: Präsentationsvorlage: ein Tagebuch-Objekt (ohne Beschreibung)

source: until
de: bis

source: media stop
de: Medien anhalten

source: Turn on hover help
de: Maus-darüber-Hilfe einschalten

source: permanently deletes items in trash
de: Mülleimer endgültig leeren

source: top of Action 1 stack
de: Stapelanfang von Aktion 1

source: a programmable block: used to add advanced single-variable math equations, e.g., sin(x)
de: Ein programmierbarer Block für fortgeschrittene mathematische Ausdrücke mit einer Variablen, z.B. sin(x)

source: Palette of flow operators
de: Palette der Flussoperatoren

source: top of a collapsed stack
de: Anfang eines zugeklappten Stapels

source: if-then-else operator that uses boolean operators from Numbers palette
de: Wenn-Dann-Sonst-Operator, der boolesche Operatoren aus der mathematischen Palette nutzt

source: returns mouse y coordinate
de: Gibt die y-Koordinate des Mauszeigers zurück.

source: holds current pen shade
de: Die aktuelle Schattierung des Stiftes

source: sinewave
de: Sinuswelle

source: Login failed
de: Anmeldung fehlgeschlagen

source: left x
de: links: x

source: set heading
de: setze Richtung

source: RGB color under the turtle is pushed to the stack
de: RGB-Farbton unter der Schildkröte wird in den Stapel eingefügt

source: declutters canvas by hiding blocks
de: Fenster durch Verbergen von Blöcken aufräumen

source: Python chr operator
de: chr-Operator von Python

source: horizontal space
de: horizontaler Zwischenraum

source: Metric coordinates
de: Metrische Koordinaten

source: string value
de: Zeichenkette

source: description
de: Beschreibung

source: I don't know how to
de: Ich kann nicht

source: set text size
de: setze Schriftgröße

source: Username:
de: Benutzername:

source: starts filled polygon (used with end fill block)
de: Beginnt ein gefülltes Polygon (benötigt einen Füllung-beenden-Block)

source: presentation template: select four Journal objects
de: Präsentationsvorlage: vier Tagebuch-Objekte

source: View
de: Ansicht

source: sets gray level of the line drawn by the turtle
de: Grauton der Schildkrötenspur festlegen

source: Password:
de: Kennwort:

source: turtle sees
de: Schildkröte sieht

source: stop action
de: beende Aktion

source: green
de: Grün

source: shade
de: Schattierung

source: fills the background with (color, shade)
de: Den Hintergrund mit (Farbe, Schattierung) füllen

source: save picture
de: Bild speichern

source: pitch
de: Tonhöhe

source: returns 1 if mouse button is pressed
de: Gibt 1 zurück, wenn die Maustaste gedrückt ist.

source: Rescale coordinates up
de: Koordinaten hochskalieren

source: pen up
de: hebe Stift an
