Repository: sugarlabs/turtleart-activity
Catalog: po/*.po
Languages: de

source: pauses program execution a specified number of seconds
de: Programmausführung für die angegebene Dauer in Sekunden unterbrechen

source: pushes value onto FILO (first-in last-out heap)
de: schreibt den Wert in den FILO-Stapel (first in, last out)

source: clear all
de: Alles löschen

source: then
de: dann

source: Register
de: Registrieren

source: not
de: nicht

source: if then else
de: wenn dann sonst

source: stops current action
de: Aktuelle Aktion beenden

source: turns turtle clockwise (angle in degrees)
de: Schildkröte im Uhrzeigersinn drehen (Winkel in Grad)

source: holds current gray level (can be used in place of a number block)
de: Der aktuelle Grauton (kann an Stelle eines Zahlenblocks benutzt werden)

source: xcor of left of screen
de: x-Koordinate des linken Bildschirmrandes

source: Reset block size
de: Blockgröße zurücksetzen

source: turtle
de: Schildkröte

source: displays next palette
de: Nächste Palette anzeigen

source: hide blocks
de: Blöcke verbergen

source: light level detected by camera
de: Lichtstärke, die von der Kamera wahrgenommen wird

source: Python int operator
de: int-Operator von Python

source: logical less-than operator
de: Logischer Kleiner-als-Operator

source: restore all blocks from trash
de: Alle gelöschten Blöcke wiederherstellen

source: Save
de: Speichern

source: store in box 1
de: speichere in Box 1

source: store in box 2
de: speichere in Box 2

source: hides the Sugar toolbars
de: Sugar-Leiste verbergen

source: holds current x-coordinate value of the turtle (can be used in place of a number block)
de: Der aktuelle x-Wert der Schildkröten-Position (kann an Stelle eines Zahlenblocks benutzt werden)

source: print
de: Ausgabe

source: returns mouse x coordinate
de: Gibt die x-Koordinate des Mauszeigers zurück.

source: red
de: Rot

source: Save as Logo
de: Als Logo speichern

source: sets color of the line drawn by the turtle
de: Farbe der Schildkrötenspur festlegen

source: set text color
de: setze Schriftfarbe

source: loudness
de: Lautstärke

source: Enable collaboration
de: Zusammenarbeit erlauben

source: Palette of sensor blocks
de: Palette der Sensorblöcke

source: Load plugin
de: Plugin laden

source: returns True if mouse button is pressed
de: Gibt Wahr zurück, wenn die Maustaste gedrückt ist.

source: number
de: Zahl

source: query keyboard
de: lies Tastatureingabe aus

source: top
de: oben

source: Submit to Web
de: Hochladen

source: Cartesian coordinates
de: Kartesische Koordinaten

source: Nickname
de: Spitzname

source: set scale
de: setze Skalierung

source: Share selected blocks
de: Teile ausgewählte Blöcke

source: white
de: Weiß

source: connects action to toolbar run buttons
de: Aktion mit Startknöpfen in der Werkzeugleiste verbinden

source: elapsed time (in seconds) since program started
de: Verstrichene Zeitdauer (in Sekunden) seit dem Programmstart

source: Cancel
de: Abbrechen

source: the canvas height
de: Die Fensterhöhe

source: presentation 2x1
de: Präsentation 2x1

source: and
de: und

source: top of a collapsible stack
de: Anfang eines zuklappbaren Stapels

source: as input
de: als Eingabe

source: media wait
de: Medien abwarten

source: acceleration
de: Beschleunigung

source: holds current pen size (can be used in place of a number block)
de: Die aktuelle Stiftdicke (kann an Stelle eines Zahlenblocks benutzt werden)

source: set color
de: setze Farbe

source: loads a block
de: Einen Block laden

source: Palette of pen commands
de: Palette der Stiftbefehle

source: shows values in FILO (first-in last-out heap)
de: zeigt Werte im FILO-Stapel (first in, last out)

source: do-while-True operator that uses boolean operators from Numbers palette
de: Wiederhole-solange-Operator, der boolesche Operatoren aus der mathematischen Palette nutzt

source: File
de: Datei

source: logical NOT operator
de: Logischer NICHT-Operator

source: ycor of bottom of screen
de: y-Koordinate des unteren Bildschirmrandes

source: presentation template: select Journal object (with description)
de: Präsentationsvorlage: ein Tagebuch-Objekt (mit Beschreibung)

source: Palette of numeric operators
de: Palette der mathematischen Operatoren

source: multiply
de: mal

source: forever
de: fortlaufend

source: Plugin %s already installed.
de: Das Plugin %s ist bereits installiert.

source: sets shade of the line drawn by the turtle
de: Schattierung der Schildkrötenspur festlegen

source: speaks text
de: spricht einen Text

source: snapshot
de: Momentaufnahme

source: clean
de: lösche alles

source: presentation template: select two Journal objects
de: Präsentationsvorlage: zwei Tagebuch-Objekte

source: Grow blocks
de: Blöcke vergrößern

source: Fullscreen
de: Vollbild

source: File not found
de: Datei nicht gefunden

source: show
de: zeige

source: random
de: Zufallszahl

source: logical greater-than operator
de: Logischer Größer-als-Operator

source: turns turtle counterclockwise (angle in degrees)
de: Schildkröte gegen den Uhrzeigersinn drehen (Winkel in Grad)

source: black
de: Schwarz

source: calculates square root
de: Quadratwurzel berechnen

source: holds current y-coordinate value of the turtle (can be used in place of a number block)
de: Der aktuelle y-Wert der Schildkröten-Position (kann an Stelle eines Zahlenblocks benutzt werden)

source: mouse x
de: Maus-x

source: mouse y
de: Maus-y

source: greater than
de: größer als

source: xcor
de: x-Wert

source: Help
de: Hilfe

source: Save project?
de: Projekt speichern?

source: chooses which turtle to command
de: Die zu steuernde Schildkröte wählen

source: right x
de: rechts: x

source: sets color of text drawn by the turtle
de: Farbe des Textes festlegen, den die Schildkröte zeichnet

source: light level detected by light sensor
de: vom Lichtsensor wahrgenommene Leuchtstärke

source: Plugin could not be installed.
de: Das Plugin konnte nicht installiert werden.

source: keyboard
de: Tastatur

source: arc
de: Kreisbogen

source: Polar coordinates
de: Polarkoordinaten

source: set shade
de: setze Schattierung

source: logical AND operator
de: Logischer UND-Operator

source: You must have an account at http://turtleartsite.sugarlabs.org to upload your project.
de: Du benötigst einen Account auf http://turtleartsite.sugarlabs.org um dein Projekt hochzuladen.

source: Run
de: Ausführen

source: show heap
de: zeige Stapel

source: sets the heading of the turtle (0 is towards the top of the screen.)
de: Richtung der Schildkröte festlegen (0 zeigt zum oberen Bildschirmrand.)

source: selects a palette
de: Eine Palette wählen

source: microphone input volume
de: Mikrofoneingangslautstärke

source: Title:
de: Titel:

source: Palette of media objects
de: Palette der Medienobjekte

source: Restore blocks from trash
de: Alle gelöschten Blöcke wiederherstellen

source: Palette of variable blocks
de: Palette der Variablenblöcke

source: used as numeric input in mathematic operators
de: Als Zahleneingabe in mathematischen Operatoren

source: Upload
de: Hochladen

source: presentation 2x2
de: Präsentation 2x2

source: Variable 1 (numeric value)
de: Variable 1 (Zahlenwert)

source: Neighborhood
de: Umgebung

source: adds two alphanumeric inputs
de: Addiert zwei Zahleneingaben

source: equal
de: gleich

source: else
de: sonst

source: doesn't like
de: mag nicht

source: You have unsaved work. Would you like to save before quitting?
de: Du hast ungespeicherte Veränderungen. Möchtest du sie vor dem Beenden abspeichern?

source: restores hidden blocks
de: Verborgene Blöcke wiederherstellen

source: stop video or audio
de: Audio oder Video anhalten

source: Turtle will not draw when moved.
de: Die Schildkröte zeichnet nicht, wenn sie sich bewegt.

source: pop
de: aufnehmen

source: pen size
de: Stiftdicke

source: turtle shell
de: Schildkrötenpanzer

source: plays a sinewave at frequency, amplitude, and duration (in seconds)
de: spielt eine Sinuswelle mit der Frequenz, der Amplitude und der Dauer (in Sekunden)

source: speak
de: sprich

source: read value from RFID device
de: Wert aus RFID-Quelle auslesen

source: moves turtle along an arc
de: Schildkröte entlang eines Kreisbogens bewegen

source: make a uturn
de: Die Richtung umkehren

source: logical equal-to operator
de: Logischer Ist-gleich-Operator

source: Palette of pen colors
de: Palette der Stiftfarben

source: pause video or audio
de: Audio oder Video unterbrechen

source: stores numeric value in Variable 1
de: Zahlenwert in Variable 1 speichern

source: stores numeric value in Variable 2
de: Zahlenwert in Variable 2 speichern

source: put a custom 'shell' on the turtle
de: Den 'Panzer' der Schildkröte anpassen

source: button down
de: Taste gedrückt

source: moves turtle backward
de: bewegt die Schildkröte rückwärts

source: ycor of top of screen
de: y-Koordinate des oberen Bildschirmrandes

source: Show blocks
de: Blöcke anzeigen

source: Colors
de: Farben

source: sets size of the line drawn by the turtle
de: Breite der Schildkrötenspur festlegen

source: Open
de: Öffnen

source: orientation
de: Orientierung

source: ycor
de: y-Wert

source: a programmable block: used to add advanced multi-variable math equations, e.g., sqrt(x*x+y*y)
de: Ein programmierbarer Block für fortgeschrittene mathematische Ausdrücke mit mehreren Variablen wie wurzel(x*x+y*y)

source: if
de: wenn

source: moves turtle to position xcor, ycor; (0, 0) is in the center of the screen.
de: Schildkröte zur Position x,y bewegen; (0,0) liegt in Bildschirmmitte.

source: Stop
de: Stopp

source: action 2
de: Aktion 2

source: action 1
de: Aktion 1

source: end fill
de: beende Füllung

source: Copy
de: Kopieren

source: Paste
de: Einfügen

source: did not output to
de: keine Ausgabe erfolgt

source: Activities
de: Aktivitäten

source: Upload to Web
de: Ins Netz hochladen

source: empty heap
de: leere Stapel

source: pops value off FILO (first-in last-out heap)
de: nimmt den Wert aus dem FILO-Stapel (first in, last out)

source: Clean
de: Alles löschen

source: Palette of presentation templates
de: Palette der Präsentationsvorlagen

source: angle
de: Winkel

source: identity
de: Gleichheit

source: Save/Load
de: Speichern/Laden

source: top y
de: oben: y

source: Tools
de: Werkzeuge

source: comment
de: Anmerkung

source: subtracts bottom numeric input from top numeric input
de: Die untere Zahleneingabe von der oberen subtrahieren

source: media pause
de: Medien unterbrechen

source: push destination rgb value to heap
de: Füge den Ziel-RGB-Wert zum Stapel hinzu

source: query for keyboard input (results stored in keyboard block)
de: Tastatureingabe auslesen (das Ergebnis wird im Tastaturblock gespeichert)

source: Cartesian
de: Kartesisch

source: clears the screen and reset the turtle
de: Bildschirm leeren und Schildkröte zurücksetzen

source: raw microphone input signal
de: Mikrofoneingangssignal

source: returns the color that the turtle "sees"
de: Gibt die Farbe zurück, welche die Schildkröte "sieht".

source: invokes Action 1 stack
de: Stapel von Aktion 1 afurufen

source: Palette of turtle commands
de: Palette der Schildkröten-Befehle

source: loops forever
de: Endlos wiederholen

source: show aligned
de: zeige ausgerichtet

source: Turtle Art
de: Schildkrötenkunst

source: Do you want to reinstall %s?
de: Willst du %s erneut installieren?

source: Load project
de: Projekt laden

source: Project
de: Projekt

source: Debug
de: Fehlersuche

source: Turn off hover help
de: Maus-darüber-Hilfe ausschalten

source: Password
de: Kennwort

source: vertical space
de: Vertikaler Zwischenraum

source: Please restart Turtle Art in order to use the plugin.
de: Starte die Schildkrötenkunst bitte neu, um das Plugin zu benützen.

source: completes filled polygon (used with start fill block)
de: Schließt ein gefülltes Polygon ab (benötigt einen Füllung-beginnen-Block)

source: Share
de: Teilen

source: less than
de: kleiner als

source: square root
de: Quadratwurzel

source: Rescale coordinates
de: Koordinaten skalieren

source: show blocks
de: Blöcke anzeigen

source: Quit
de: Beenden

source: Sugar Journal description field
de: Beschreibungsfeld im Sugar-Tagebuch

source: set gray
de: setze Grauton

source: presentation bulleted list
de: Darstellung als Spiegelstrichliste

source: duration
de: Dauer

source: New
de: Neu

source: places a comment in your code
de: Kommentar in dein Programm einfügen

source: read pixel
de: lies Pixel

source: scale
de: Skalierung

source: bottom
de: unten

source: purple
de: Violett

source: Rescale coordinates down
de: Koordinaten herunterskalieren

source: click to open
de: Zum Öffnen klicken

source: microphone input pitch
de: Mikrofoneingangstonhöhe

source: Configuration
de: Konfiguration

source: Description:
de: Beschreibung:

source: journal
de: Tagebuch

source: empty trash
de: Mülleimer leeren

source: Turtle will draw when moved.
de: Die Schildkröte zeichnet, wenn sie sich bewegt.

source: Load...
de: Laden...

source: Sugar Journal audio object
de: Audioobjekt aus dem Sugar-Tagebuch

source: Stop turtle
de: Schildkröte anhalten

source: Turtle
de: Schildkröte

source: changes the orientation of the palette of blocks
de: Die Ausrichtung der Block-Palette ändern

source: store in
de: speichere in

source: Hide blocks
de: Blöcke verbergen

source: Load Python block
de: Python-Block laden

source: or
de: oder

source: presentation template: list of bullets
de: Präsentationsvorlage: Spiegelstrichliste

source: identity operator used for extending blocks
de: Identitätsoperator, um Blöcke zu erweitern

source: Shrink blocks
de: Blöcke verkleinern

source: sets size of text drawn by the turtle
de: Größe des Textes festlegen, den die Schildkröte zeichnet

source: holds current heading value of the turtle (can be used in place of a number block)
de: Die aktuelle Richtung der Schildkröte (kann an Stelle eines Zahlenblocks benutzt werden)

source: image
de: Bild

source: returns random number between minimum (top) and maximum (bottom) values
de: Eine Zufallszahl zwischen dem Minimal- (oben) und Maximalwert (unten)

source: holds current pen color (can be used in place of a number block)
de: Die aktuelle Stiftfarbe (kann an Stelle eines Zahlenblocks benutzt werden)

source: Show palette
de: Palette anzeigen

source: saves a picture to the Sugar Journal
de: Ein Bild ins Sugar-Tagebuch speichern

source: Save snapshot
de: Momentaufnahme speichern

source: start
de: starte

source: returns True if heap is empty
de: Gibt Wahr zurück, wenn der Stapel leer ist.

source: moves turtle forward
de: bewegt die Schildkröte vorwärts

source: forward
de: gehe vorwärts

source: my box
de: Meine Box

source: Account ID
de: Account-Kennung

source: back
de: zurück

source: sets the scale of media
de: Skalierung der Medien setzen

source: holds current scale value
de: behält aktuellen Skalierungsfaktor bei

source: presentation 1x1
de: Präsentation 1x1

source: presentation 1x2
de: Präsentation 1x2

source: top of nameable action stack
de: Stapelanfang einer benennbaren Aktion

source: stores numeric value in named variable
de: Zahlenwert in benannte Variable speichern

source: logical OR operator
de: Logischer ODER-Operator

source: microphone input voltage
de: Mikrofoneingangsspannung

source: loops specified number of times
de: So oft wiederholen, wie angegeben

source: Save...
de: Speichern...

source: invokes Action 2 stack
de: Stapel von Aktion 2 aufrufen

source: title y
de: Titel: y

source: title x
de: Titel: x

source: fill screen
de: fülle Bildschirm

source: Save as
de: Speichern unter

source: set xy
de: setze xy

source: trash
de: Müll

source: repeat
de: wiederhole

source: wait for current video or audio to complete
de: Das Ende der aktuellen Video- oder Audio-Wiedergabe abwarten

source: Save as image
de: Als Bild speichern

source: Edit
de: Bearbeiten

source: microphone input resistance
de: Mikrofoneingangswiderstand

source: top of Action 2 stack
de: Stapelanfang von Aktion 2

source: divides top numeric input (numerator) by bottom numeric input (denominator)
de: Dividiert die obere Zahleneingabe (Zähler) durch die untere (Nenner)

source: prints value in status block at bottom of the screen
de: Zeigt den Wert im Statusblock am unteren Bildschirmrand an

source: start fill
de: beginne Füllung

source: holds results of query-keyboard block as ASCII
de: Beinhaltet das Ergebnis des Tastaturabfrage-Blocks als ASCII-Zeichen.

source: push
de: ablegen

source: a programmable block: used to add advanced multi-variable math equations, e.g., sin(x+y+z)
de: Ein programmierbarer Block für fortgeschrittene mathematische Ausdrücke mit mehreren Variablen, z.B. sin(x+y+z)

source: restore all
de: Alles rückgängig

source: hello
de: Hallo

source: Please install the Speak Activity and try again.
de: Installiere bitte die Sprechen-Aktitvität und versuch es noch einmal.

source: Spanish
de: Spanisch

source: English
de: Englisch

source: Sorry, I can't understand what you are asking about.
de: Tut mir leid, ich kann nicht verstehen, wonach du fragst.

source: Sorry, there is no free memory to load my brain. Close other activities and try once more.
de: Entschuldige, es gibt keinen freien Speicher, um mein Gehirn zu laden. Schließe andere Aktivitäten und versuch es noch einmal.
